-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1
-- Généré le : ven. 21 août 2020 à 18:21
-- Version du serveur :  10.4.11-MariaDB
-- Version de PHP : 7.4.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `courses`
--

-- --------------------------------------------------------

--
-- Structure de la table `admins`
--

CREATE TABLE `admins` (
  `id` int(10) NOT NULL,
  `first_name` varchar(255) NOT NULL,
  `last_name` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `admins`
--

INSERT INTO `admins` (`id`, `first_name`, `last_name`, `username`, `email`, `password`, `date`) VALUES
(1, 'admin', 'admin', 'admin', 'admin@admin.com', '$2y$10$AL7T/Y1zMEim18CjkPiQZe3uNfZ3GxaDtmg95DI2RcAbjN0eIV3Re', '2020-07-13 20:23:23');

-- --------------------------------------------------------

--
-- Structure de la table `contact`
--

CREATE TABLE `contact` (
  `id` int(10) NOT NULL,
  `email` varchar(255) NOT NULL,
  `comment` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Structure de la table `courses`
--

CREATE TABLE `courses` (
  `id` int(10) NOT NULL,
  `course_name` varchar(255) NOT NULL,
  `creator` varchar(255) NOT NULL,
  `path_id` int(10) NOT NULL,
  `description` text NOT NULL,
  `intro_course` text NOT NULL,
  `course_img` varchar(255) NOT NULL,
  `visible` int(10) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `courses`
--

INSERT INTO `courses` (`id`, `course_name`, `creator`, `path_id`, `description`, `intro_course`, `course_img`, `visible`, `date`) VALUES
(6, 'اساسيات الجافا', 'محمد', 10, 'تدور الدورة حول اساسيات الجافا بشكل خاص و البرمجة بشكل عام والتي على كل مبرمج معرفتها قبل الولوج لعالم البرمجة .', 'جافا (بالإنجليزية: Java)&rlm; هي لغة برمجة كائنية التوجه، ابتكرها جيمس غوسلينغ في عام 1992م -أثناء عمله في مختبرات شركة صن ميكروسيستمز- وذلك لاستخدامها بمثابة العقل المفكر المستخدم لتشغيل أجهزة التطبيقات الذكية مثل التليفزيون التفاعلي، وقد كانت لغة الجافا تطويرًا للغة سي ++، وعند ولادتها أطلق عليها مبتكرها &quot;أواك&quot; بمعنى شجرة السنديان؛ وهي الشجرة التي كان يراها من نافذة مكتبه وهو يعمل في مختبرات صن ميكروسيستمز، ثم تغير الاسم إلى جافا، وهذا الاسم (على غير العادة في تسمية لغات البرمجة) ليس الحروف الأولى من كلمات جملة معينة أو تعبيرًا بمعنى معين، ولكنه مجرد اسم وضعه مطورو هذه اللغة لينافس الأسماء الأخرى.  \r\n        تتميز لغة جافا بمميزات خاصة مما يجعلها أكثر لغات البرمجة إثارة:\r\n    حيث أن ما يميزها الآتي:\r\n\r\n    1-السهولة.\r\n    2-تدعم مفهوم البرمجة الشيئية (البرمجة كائنية التوجه).\r\n    3-سهولة الحصول عليها.\r\n    4-امنة.\r\n    5-قابلة للنقل والتنفيذ.\r\n    6-إضافة الحركة والصوت إلى صفحات الويب.\r\n    7-كتابة الألعاب والبرامج المساعدة.\r\n    8-إنشاء برامج ذات واجهة مستخدم رسومية.\r\n    9-تصميم برمجيات تستفيد من كل مميزات الأنترنت. توفر لغة الجافا بيئة تفاعلية عبر الشبكة العنكبوتية وبالتالي تستعمل لكتابة برامج تعليمية للإنترنت عبر برمجيات المحاكاة الحاسوبية للتجارب العلمية وبرمجيات الفصول الافتراضية للتعليم الإلكتروني والتعليم عن بعد. لا تنحصر فاعلية الجافا في الشبكة العنكبوتية فقط بل تمكننا من إنشاء برامج للاستعمال الشخصي والمهني، هذه البرامج تنجز عبر جملة من البرامج التي تسهل كتابة الأوامر كبرنامج نت بينز واكليبس.', 'java-logo', 1, '2020-08-14 20:54:32'),
(7, 'كوتلن', 'محمد', 11, 'كوتلن هي لغة تستخدم لانشاء تطبيقات بسيطة او احترافية لهواتف الاندرويد', 'كوتلن (بالإنجليزية: Kotlin)&rlm; هي لغة برمجة كائنيّة Object Oriented تعمل على منصة جافا كما يُمكن تشغيلها على منصة لغة جافا سكريبت.\r\nطوّر اللغة مجموعة من المُبرمجين في شركة جيتبراينز والتي يقع مقرّها في سانت بطرسبرغ في روسيا -حيث أن اسم اللغة مستوحى من جزيرة كوتلن القريبة من المدينة- وهي نفس الشركة التي طورت أندرويد استوديو الأداة الرسمية لتطوير تطبيقات أندرويد. \r\nوقد تم تصميم كوتلن للتعامل والتوافق الكامل مع الجافا وحزمة تطويرها JDK ومكتبة الأكواد وتتيح كتابة الشيفرة البرمجية بعدد أقل من الأسطر وبشكل أسرع وأكثر فاعلية مقارنةً بلغة جافا، حيث تُعتَبر شبيهة بلغة سويفت من أبل', 'kotlen', 1, '2020-08-21 14:37:45');

-- --------------------------------------------------------

--
-- Structure de la table `course_pages`
--

CREATE TABLE `course_pages` (
  `id` int(10) NOT NULL,
  `course_id` int(10) NOT NULL,
  `lesson_title` varchar(50) NOT NULL,
  `lesson_img` varchar(255) NOT NULL,
  `lesson_content` text NOT NULL,
  `page_index` int(10) NOT NULL,
  `visible` int(1) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `course_pages`
--

INSERT INTO `course_pages` (`id`, `course_id`, `lesson_title`, `lesson_img`, `lesson_content`, `page_index`, `visible`, `date`) VALUES
(3, 1, 'المتغيرات Variables', 'Capture.PNG', 'المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات المتغيرات', 1, 1, '2020-08-12 22:27:37'),
(4, 1, 'التكرار', '58fe0a82756931.5d271fdb9caa6.png', 'التكرار  التكرار   التكرار  التكرار  التكرار  التكرار   التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  التكرار  Loops', 2, 1, '2020-08-12 22:31:24'),
(7, 1, 'الافعال Methods', 'UI_Mobile2.png', 'الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال  \r\nالافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال \r\n\r\n\r\nالافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال الافعال', 3, 1, '2020-08-13 22:55:59'),
(8, 6, 'المتغيرات  declare Variables', 'java_var.png', 'في لغة الجافا لكل متغير نوع معين، عند تعريف المتغير يتم وضع نوعه قبل اسم المتغير، وهذه بعض الأمثلة على ذلك :      \r\n\r\n;double salary                                                                                                                                                                                         \r\n ;int vacationDay\r\n ;long earthPopulation \r\n;boolean done  \r\n\r\nمع ملاحظة الفاصلة المنقطة (semicolon) عند نهاية كل تعريف(statment)، وهي ضرورية لإنهاء كل جملة يُراد تنفيذها.\r\n\r\n المتغير يجب أن يبدأ بحرف وأن يتكون من سلسلة من الأحرف(letter) أو الأرقام(digit) بدون مسافات فيما بينها.  \r\n مصطلح الأحرف (letter) والأرقام (digit) في لغه الجافا يتضمن معنى أوسع من باقي لغات البرمجة. فالمقصود بالأحرف (letter) في الجافا: ( \'A\' إلى \'Z\') و( \'a\' إلى \'z\') و\'_\' وأي رمز آخر مخصص يمثل حرفاً في اللغات الأخرى، وهنا بعض الأمثلة لتوضيح هذه الفكرة بشكل أفضل : بإمكان مستخدمي اللغة الألمانية استعمال حرف \' &auml; \' كمتغير داخل البرنامج، وعلى سبيل المثال أيضاً اليونانيون يستطيعون استعمال\' &pi; \'. و كذلك الأرقام (digit) فالمقصود منها في الجافا : (0 - 9) أو أي رمز مخصص يمثل رقماً في أي لغة أخرى مثل (+) و(@) فهذه الرموز بالإضافة إلى المسافة (space) لا يُمكن استعمالها لتمثيل اسم متغير. جميع الحروف أو الرموز التي تكوّن اسم المتغير تعتبر عنصراً هامّاً في تمييزه من قبل الجافا وكذلك حالة الأحرف (upper case) أو (lower case).\r\n\r\nمع العلم بأن هناك كلمات محجوزة لعمليات خاصة من قبل الجافا لا يجوز للمبرمج استعمالها كإسم لمتغير. ويمكنك تعريف أكثر من متغير في سطر واحد ثم وضع فاصلة منقطة في نهاية السطر، مثال:\r\n; int i , j\r\n\r\n ولكن هذه الطريقة غير محبذة لأن تعريف كل متغير في سطر مخصص له يجعل البرنامج أسهل للقراءة', 1, 1, '2020-08-16 12:39:35'),
(9, 6, 'الدوال Methods', 'java_function.png', '\r\n&bull; وتسمى الطرق أو المنهاج وهي التي من وضع المبرمج &bull; والهدف منها إنه عند تكرار مجموعة من سطور الأوامر أكثر من مرة في مواضع مختلفة فإن أوامر التكرار لن تكون ذات منفعة . ولذلك يتم كتابة هذه السطور منفصلة عن البرنامج الأساسي مزايا استخدام الدوال 1- عدم تكرار التعليمات داخل البرنامج : حيث يتم إنشاء الدالة مرة واحدة ثم يتم استدعائها أكثر من مرة عند الحاجة إليها . 2- باستخدام الدوال يصبح البرنامج أكثر وضوحاً .\r\n\r\nأنواع معدلات الوصول public : عامة أي تستطيع الوصول إليها من خارج الكلاس ومن خارج البرنامج أيضا private : هي بمعنى خاصة وتستطيع الوصول للداتا من داخل الكلاس فقط ولايمكن أن توصل لها من خارج الكلاس إطلاقا protected : محمي أي انك تستطيع الوصول للدالة من داخل الكلاس لو من خارح الكلاس إذا آان الكلاس يرث منه\r\n\r\nاستخدمنا العبارة static من أجل اخبار المترجم على أن هذة الدالة من نوع ثابت أي انة يقوم بالتعرف عليها قبل الدخول إلى الدالة الرئيسية . وهذا كود بسيط يبين عمل الدوال ويقوم بتربيع عدد ما class bv { public static void t (int b){ System.out.println(b*b); } public static void main(String[] args ( t(3); } }\r\n\r\nأنواع الطرق : نستطيع تقسيم الطرق إلى نوعين حسب الإعادة . في بعض الطرق التي يتم تحديد نوع القيمة المرجعة، تقوم بإرجاع قيمة عن طريق استخدام الكلمة return بينما لا ترجع الطرق من نوع void شيئاً .\r\n\r\nكما يمكننا تقسيم الطرق حسب وضعية الوظيفة في الفئة إلى نوعين، طرق خاصة بالفئة، وطرق خاصة بالعضو . و يتم في النوع الأول كتابة كلمة (static) في توقيع الوظيفة (method signature) .\r\n\r\nوهكذا نكون قد جعلنا هذه الوظيفة هي خاصة بالفئة بشكل عام و ليست خاصة لعضو من الأعضاء. و بإمكان أي عضو استخدامها من الفئة مباشرة دون الحاجة لإنشاء عضو من الفئة. و كمثال على ذلك نفس المثال السابق لتربع العدد . فنحن نستطيع استخدامها بالإشارة لاسم الفئة مباشرة دون الحاجة لإنشاء عضو في الفئة، و استخدامها عبره\r\n\r\nتماماً كما في المثال السابق، يمكننا أن نجعل طرق الجمع static و نستخدمها مباشرة دون الحاجة لإنشاء عضو من فئة Addtwo .\r\n\r\nقاعدة / عند كتابة الدالة مثل هذا الكود فيجب إطلاق هدف باسم الكلاس نفسه ومن ثم كتابة اسم الهدف الجديد. اسم الدالة المراد استخدامها وان كتبت اسم الدالة مباشرة فان المترجم سيصدر خطأ ولن ينفد البرنامج .\r\n. .', 2, 1, '2020-08-21 14:12:33'),
(10, 6, 'النصوص Strings', 'java-string', 'النصوص في لغة الجافا هي تسلسل أحرف من الترميز الموحد يُونِكُود.\r\n على سبيل المثال، السلسلة النصية &quot;java\\u2122&quot; تتكون من خمسة أحرف J, a, v, a, TM . جافا تتضمن عدة أنواع من أنواع البيانات مثل int, float, double ولكنها لا تتضمن نوع String, لذلك يوجد في جافا مكتبة تحتوي على فئة معرفة مسبقا خاصة بهذا النوع من انواع البيانات تسمى String. \r\nعندما نستخدم هذا النوع في تعريف المتغيرات النصية فإننا في هذه الحالة نُنشأ كائن لحظي من فئة String.\r\n\r\nالمثال التالي يوضح لنا طريقة تعريف متغير من نوع String، ويجب ان ننتبه أن النص يكون مكتوب بين علامتي تنصيص &quot;&quot;.\r\n\r\n&quot;&quot; = String e\r\n\r\nهنا قمنا بتعريف متغير نصي فارغ ولاحظ انه حتى يكون فارغ لم نضع مسافة داخل علامة التنصيص، في حال كان هناك مسافة بين علامتي التنصيص فانه لن يكون فارغ.\r\n\r\n&quot;String greeting = &quot;Hello\r\n\r\nهذا المتغير من نوع String يحتوي على كلمة &ldquo;Hello&rdquo;.\r\n\r\n1-اقتطاع جزء من النص Substrings\r\n\r\nعندما يكون لديك سلسة نصية وتريد أن تقتطع من هذه السلسة مجموعة أحرف فإنك تستطيع ان تقوم بذلك عن طريق دالة substring. دالة substring يمكن ان تُمرر بداخلها معاملين الأول يشير إلى عنوان أول حرف سوف تبدأ الدالة تقتطع منه والثاني يشير إلى أول عنوان لا تريده ان يكون من ضمن الجزء المستقطع. والمثال التالي يوضح ذلك،\r\n\r\n\r\n&quot;String greeting = &quot;Hello\r\n(String s = greeting.substring(0, 3\r\n\r\nفي السطر الأول كان لدينا متغير اسمه greeting من نوع String ومخزن بداخله كلمة &ldquo;Hello&rdquo;، وفي السطر الثاني عرفنا متغير اخر من نفس النوع وهذا المتغير سوف يحوي ناتج دالة substring. وفي حالتنا هذه كانت المعاملات المرسلة في هذه الدالة (o,3) بمعنى ان الدالة سوف تأخذ العنوان 0,1,2 فقط. وهذا يعني ان أول عنوان يُأخذ في الحسبان ولكن ثاني عنوان تستثنيه الدالة وتنظر إلى ما قبل هذا العنوان. إذاً الناتج المُخزن في هذا المتغير سيكون &ldquo;Hel&rdquo;.\r\n\r\nتوجد ميزة واحدة لطريقة عمل دالة substring, إنها تجعل من السهل حساب طول السلسلة النصية. السلسلة النصية (s.substring(a, b طولها يساوي b - a. وتطبيقاً على مثالنا أعلاه فإن طول &ldquo;Hel&rdquo; يساوي 3-0 = 3.\r\n\r\n2-التجميع  Concatenation\r\n\r\nجافا كأغلب لغات البرمجة، تسمح لك باستخدام إشارة + بغرض ربط سلسلتين نصية.\r\n\r\n&quot;String expletive = &quot;Expletive\r\n&quot;String PG13 = &quot;deleted\r\nString message = expletive + PG13\r\n\r\nفي المثال السابق عرفنا ثلاثة متغيرات من نوع String أول متغيرين يحتويان على سلسلة نصية، الآن في المتغير الثالث نريد أن نربط أول سلسلتين مع بعضهم البعض عن طريق إشارة + تجمع بين اسم المتغير الأول والمتغير الثاني وبالتالي يصبح الناتج &quot;Expletivedeleted&quot;. ( لاحظ انه عندما نستخدم هذه الإشارة للربط فانها تفتقر إلى المسافة بين الكلمات في حال لم يكن في اصل الكلمة توجد مسافات، إشارة + تربط بين سلسلتين نصية بالترتيب الذي تستقبله، تماما كما أُعطيت ).\r\n\r\nعندما تريد أن تجمع بين قيم نوعها ليس سلسلة نصية فانها سوف تُحول إلى String. على سبيل المثال،\r\n\r\nint age = 13\r\nString rating = &quot;PG&quot; + age\r\n\r\nعلى الرغم أن متغير age نوعه عدد صحيح int ولكن عندما يتم ربطه باشارة + مع سلسلة نصية أُخرى فإنه سوف يتحول إلى سلسة نصية String.ويُخزن الناتج في متغير rating.\r\n\r\nهذه الميزة تستخدم بشكل شائع في جمل الإخراج، على سبيل المثال،\r\n\r\n(System.out.println(&quot;The answer is &quot; + answer\r\n\r\nهذا مقبول وسوف يطبع ما يريد ان يطبع اي شخص، لاحظ هنا بعد is يوجد مسافة لذلك عند الطباعة سوف تظهر لنا بين الكلمة والأخرى.', 3, 1, '2020-08-21 14:27:55'),
(11, 7, 'Basic Types', 'kotlen_Types', 'أنواع أساسية\r\n\r\nفي Kotlin ، كل شيء هو كائن بمعنى أنه يمكننا استدعاء وظائف الأعضاء وخصائص أي متغير. يمكن أن يكون لبعض الأنواع تمثيل داخلي خاص - على سبيل المثال ، يمكن تمثيل الأرقام والأحرف والمنطقات كقيم أولية في وقت التشغيل - ولكن بالنسبة للمستخدم تبدو مثل الفئات العادية. في هذا القسم ، نصف الأنواع الأساسية المستخدمة في Kotlin: الأرقام ، والأحرف ، والمنطقية ، والمصفوفات ، والسلاسل.\r\nأعداد\r\n\r\nيوفر Kotlin مجموعة من الأنواع المضمنة التي تمثل الأرقام.\r\nبالنسبة للأعداد الصحيحة ، توجد أربعة أنواع ذات أحجام مختلفة ، وبالتالي نطاقات القيمة\r\n\r\nByte\r\nShort\r\nInt\r\nLong\r\n\r\nجميع المتغيرات التي تمت تهيئتها بقيم عددية لا تتجاوز الحد الأقصى لقيمة Int لها النوع المستنتج Int. إذا تجاوزت القيمة الأولية هذه القيمة ، فسيكون النوع طويل. لتحديد القيمة الطويلة بشكل صريح ، قم بإلحاق اللاحقة L بالقيمة.', 1, 1, '2020-08-21 14:48:11'),
(12, 7, 'الكلاسات Classes', 'kotlen_classes', 'يتم الاعلان عن الكلاس بكتابة class متبوعا باسم الكلاس.\r\nبعدها يتم وضع محتوى الكلاس بعد معقوفتين   {/*...*/} \r\n\r\n1-Constuctors\r\nيمكن ان يحتوي الكلاس على constructor واحد (primary constructor) او اكثر (secondary consttructer)\r\n\r\n', 2, 1, '2020-08-21 15:20:57');

-- --------------------------------------------------------

--
-- Structure de la table `navbar_menu`
--

CREATE TABLE `navbar_menu` (
  `id` int(10) NOT NULL,
  `name` varchar(255) NOT NULL,
  `rank` int(10) NOT NULL,
  `visible` int(10) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `navbar_menu`
--

INSERT INTO `navbar_menu` (`id`, `name`, `rank`, `visible`, `date`) VALUES
(1, 'الرئيسية', 1, 1, '2020-07-11 17:06:17'),
(2, 'الدورات', 2, 1, '2020-07-11 17:08:16'),
(3, 'المسارات', 3, 1, '2020-07-23 12:50:50'),
(4, 'تواصل معنا', 4, 0, '2020-07-11 17:08:16'),
(15, 'الاخبار', 5, 0, '2020-07-21 11:50:38');

-- --------------------------------------------------------

--
-- Structure de la table `pages`
--

CREATE TABLE `pages` (
  `id` int(10) NOT NULL,
  `menu_id` int(10) NOT NULL,
  `page_name` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `description` text NOT NULL,
  `rank` int(10) NOT NULL,
  `visible` int(10) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `pages`
--

INSERT INTO `pages` (`id`, `menu_id`, `page_name`, `content`, `description`, `rank`, `visible`, `date`) VALUES
(3, 15, 'المؤتمرات', 'تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان\r\n تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان\r\n\r\n تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان\r\n\r\n تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان v vتتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان \r\n\r\nتتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان', 'تتضمن هده الصفحة كل ما يتعلق بالمؤتمرات التي اجريناها من بداية سنة 2015 الى حد الان', 1, 1, '2020-07-23 17:00:39'),
(5, 15, 'الجوائز', 'الجوائز التي حصلنا عليها  الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها  الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها', 'الجوائز التي حصلنا عليها الجوائز التي حصلنا عليها في سنة 2010', 2, 1, '2020-08-06 20:02:19');

-- --------------------------------------------------------

--
-- Structure de la table `paths`
--

CREATE TABLE `paths` (
  `id` int(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `description` text NOT NULL,
  `visible` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `paths`
--

INSERT INTO `paths` (`id`, `name`, `description`, `visible`) VALUES
(10, 'مسار الجافا', 'مسار الجافا يتضمن كل ما يتعمق بالجافا من اساسيات الى متقدم و محترف.', 1),
(11, 'مسار تطبيقات الاندرويد', 'صناعة تطبيقات الاندرويد بالاعتماد على لغة الجافا', 1);

--
-- Index pour les tables déchargées
--

--
-- Index pour la table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `contact`
--
ALTER TABLE `contact`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `courses`
--
ALTER TABLE `courses`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `course_pages`
--
ALTER TABLE `course_pages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `course_id` (`course_id`);

--
-- Index pour la table `navbar_menu`
--
ALTER TABLE `navbar_menu`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `pages`
--
ALTER TABLE `pages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `menu_id` (`menu_id`);

--
-- Index pour la table `paths`
--
ALTER TABLE `paths`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT pour les tables déchargées
--

--
-- AUTO_INCREMENT pour la table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT pour la table `contact`
--
ALTER TABLE `contact`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT pour la table `courses`
--
ALTER TABLE `courses`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT pour la table `course_pages`
--
ALTER TABLE `course_pages`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT pour la table `navbar_menu`
--
ALTER TABLE `navbar_menu`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT pour la table `pages`
--
ALTER TABLE `pages`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT pour la table `paths`
--
ALTER TABLE `paths`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
